# 1.

#### 1-1) pandas, numpy 패키지(라이브러리) 설치하기

In [4]:
# pandas, numpy 패키지(라이브러리)를 불러와주세요.

#### 1-2) users.data, rating.data를 불러와주세요(data -> movielens 폴더 안에 있습니다)

In [36]:
# users.data를 불러와주세요.

In [37]:
# ratings.data를 불러와주세요

#### 1-3) 위 두 데이터를 inner_join의 방법을 활용하여 합쳐주세요.

In [38]:
# 위 두 데이터를 inner_join의 방법을 활용하여 합쳐주세요

# 2.

- 아래 두 셀을 순서대로 실행해주세요.

In [17]:
# 같은 결과를 보기 위해 random seed값 22로 고정
np.random.seed(22)

In [21]:
# Set index multi column index
num = np.repeat(['21기', '22기'], (6, 16))
dic={1:'문과', 2:'이과'}
major = [dic[x] for x in np.random.randint(1, 3, 22)]
name = ['김지민', '신재욱', '양지현', '이상민', '이은정', '이해영',
        '김근유', '김남준', '김서민', '김세은', '김현우', '문이선', 
        '박재민', '반서현', '신연아', '신희연', '윤정현', '이다예',
        '이인학', '이지영', '이하영', '전종우']
column = [["1학기","1학기","1학기","2학기","2학기","2학기"],["언어","수리","외국어"]*2]

#### 2-1) num, major, name을 index로 column을 columns로, value값은 1부터 100사이의 random값으로 지정하여 예시와 같은 data를 만들어주세요.

- random값 지정은 계층 색인 부분의 randint 참고

In [23]:
# 출력 결과의 예시입니다. 코드는 아래에서 작성해주세요

           1학기         2학기
            언어  수리 외국어  언어  수리 외국어
21기 문과 김지민  44  26   1  36  43  81
    이과 신재욱  32  67  75   7  26  87
       양지현  14  25  39  92  38  84
       이상민  83  88  17  39   9  39
       이은정  80  87  77  93  96  71
       이해영  38  22  94  14  60  45
22기 이과 김근유  52  55  99  88  43  48
       김남준  94  12   4  99  46  61
    문과 김서민  60  19  10  41  49  75
       김세은  22  73  56  40  24  83
    이과 김현우  82  92  63  87  31  74
    문과 문이선  10   1  17  85  67  85
       박재민  76  25  63  50  26  82
       반서현  34  86  86  78  96  45
       신연아  74  60  63  93  10  70
    이과 신희연  18  50   3  68  92  79
    문과 윤정현  14  82  49   9  98  71
       이다예  50  23  38  22  52  46
       이인학  32  62  90   7  88  21
    이과 이지영   9  63  84  86  60  59
       이하영  20  52  40  15  21  84
       전종우  33  62   7  28  76  61

In [39]:
# 이 셀에서 코드를 작성해주세요

#### 2-2) 본인의 1학기, 2학기 전체 성적을 출력해주세요

In [24]:
# 출력 결과의 예시입니다. 코드는 아래에서 작성해주세요.

       1학기         2학기
        언어  수리 외국어  언어 수리 외국어
21기 이과  83  88  17  39  9  39

In [40]:
# 이 셀에서 코드를 작성해주세요.

#### 2-3) 21기 1학기 성적을 출력주세요

In [26]:
# 출력결과의 예시입니다. 코드는 아래에서 작성해주세요.

C:\Users\tkdal\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  """Entry point for launching an IPython kernel.

        언어  수리  외국어
문과 김지민  44  26    1
이과 신재욱  32  67   75
   양지현  14  25   39
   이상민  83  88   17
   이은정  80  87   77
   이해영  38  22   94

In [ ]:
# 이 셀에서 코드를 작성해주세요.

#### 2-4) 이과의 1학기, 2학기 성적을 출력해주세요

In [28]:
# 출력결과의 예시입니다. 코드는 아래에서 작성해주세요.

        1학기         2학기
         언어  수리 외국어  언어  수리 외국어
21기 신재욱  32  67  75   7  26  87
    양지현  14  25  39  92  38  84
    이상민  83  88  17  39   9  39
    이은정  80  87  77  93  96  71
    이해영  38  22  94  14  60  45
22기 김근유  52  55  99  88  43  48
    김남준  94  12   4  99  46  61
    김현우  82  92  63  87  31  74
    신희연  18  50   3  68  92  79
    이지영   9  63  84  86  60  59
    이하영  20  52  40  15  21  84
    전종우  33  62   7  28  76  61

In [41]:
# 이 셀에서 코드를 작성해주세요.

# 3.

#### 3-1) PatientInfo csv 파일 불러오기(data 폴더 안에 있습니다)

#### 3-2) patient_info에서 birth_year를 이용하여 age column에 정확한 나이(숫자)로 바꿔주세요

#### 3-3) 서울과 제주도의 확진환자 평균을 구해주세요

In [35]:
# 출력 결과의 예시입니다. 코드는 아래에서 작성해주세요.

                       age
province sex
Jeju-do  female  36.000000
         male    35.000000
Seoul    female  45.400000
         male    43.090278

In [ ]:
# 이 셀에서 코드를 작성해주세요.